{
  "kind": "build_request",
  "title": "Remove Process section, add logo assets, and add “Helped more than 1000 individuals” credibility line",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Remove the entire “Process / Our Simple Process” section from the landing page so it is no longer rendered anywhere on the site.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also remove our simple process part"
        ]
      },
      "acceptanceCriteria": [
        "The section with heading “Our Simple Process” is removed from the rendered page.",
        "No process step cards (Case Review, Documentation, EPFO Follow-up, Amount Credited) appear anywhere on the site.",
        "The page still scrolls correctly to #services and #contact anchors (no broken navigation/scroll behavior)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a credibility/statistic line with the exact text “Helped more than 1000 individuals” in the hero area, styled to fit the existing design, and ensure it is visible on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ADD HELPED MORE THAN 1000 OF INDIVIDUALS"
        ]
      },
      "acceptanceCriteria": [
        "The hero section displays the exact English text: “Helped more than 1000 individuals”.",
        "The text is legible against the hero background on common breakpoints (mobile, tablet, desktop).",
        "No other user-facing text is changed unintentionally."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a professional “ASHA PF CONSULTANCY” logo to the site using generated static image assets, and integrate it into the hero (near the main heading) and as the site favicon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a good logo too indicating ASHA PF CONSULTANCY"
        ]
      },
      "acceptanceCriteria": [
        "New logo image assets exist under frontend/public/assets/generated and are referenced directly by the frontend (not served via backend).",
        "The hero displays the logo alongside/above the “ASHA PF CONSULTANCY” headline without breaking layout on mobile or desktop.",
        "A favicon is configured in frontend/index.html and loads in the browser tab.",
        "All user-facing text remains in English."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui must not be edited; compose around them instead.",
    "Keep the backend as a single Motoko actor; no additional backend services.",
    "Do not route static images through the backend; serve them as frontend static assets."
  ],
  "nonGoals": [
    "Do not add or change backend APIs for this request.",
    "Do not add new sections beyond removing the Process section and adding the requested logo/stat line.",
    "Do not implement third-party authentication providers beyond existing Internet Identity support.",
    "Do not add analytics, tracking, or external marketing integrations."
  ],
  "imageRequirements": {
    "required": [
      "Professional wordmark logo with a simple icon, indigo/blue palette, text “ASHA PF CONSULTANCY” (asha-pf-logo.dim_1200x300.png)",
      "Simplified icon-only mark that matches the logo style (asha-pf-icon.dim_256x256.png)",
      "Minimal favicon version of the icon mark with transparent background (asha-pf-favicon.dim_64x64.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}